testing-scripts/test_unencrypted-ngtcp2-throughput_via-B_delay-0ms_uncorrelated-loss-X_percent_improved-null-encryption_with-command-line-option/results/payload-size_1000000000____delay-ms_0____loss-rate-percent_0.01____clients-requests_1/7/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 1 total client(s). 1 total requests
[WARNING! Using Null-encryption]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 100% done

finished in 4.44s, 0.23 req/s, 215.04MB/s
requests: 1 total, 1 started, 1 done, 1 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305254) total, 14B (14) headers (space savings 85.57%), 953.67MB (1000000000) data
UDP datagram: 21466 sent, 821351 received
                     min         max         mean         sd        +/- sd
time for request:      4.43s       4.43s       4.43s         0us   100.00%
time for connect:     4.92ms      4.92ms      4.92ms         0us   100.00%
time to 1st byte:     5.98ms      5.98ms      5.98ms         0us   100.00%
req/s           :       0.23        0.23        0.23        0.00   100.00%